DEFAULT_LANGUAGE = "ua"
OVERALL_START_DATE = "24-02-2022"
TIMEOUT_SECONDS = 60 * 5
TIMEOUT_BETWEEN_LINKS_REQUESTS = 1

MAX_RETRIES = 5
MAX_IDS_PER_NEWS_PROVIDER = 10


OBLAST_TO_NUM = {
    "Автономна Республіка Крим": "1",
    "Вінницька область": "2",
    "Волинська область": "3",
    "Дніпропетровська область": "4",
    "Донецька область": "5",
    "Житомирська область": "6",
    "Закарпатська область": "7",
    "Запорізька область": "8",
    "Івано-Франківська область": "9",
    "Київська область": "10",
    "Кіровоградська область": "11",
    "Луганська область": "12",
    "Львівська область": "13",
    "Миколаївська область": "14",
    "Одеська область": "15",
    "Полтавська область": "16",
    "Рівненська область": "17",
    "Сумська область": "18",
    "Тернопільська область": "19",
    "Харківська область": "20",
    "Херсонська область": "21",
    "Хмельницька область": "22",
    "Черкаська область": "23",
    "Чернівецька область": "24",
    "Чернігівська область": "25"
}

CONFIDENCE_MAPPING = {
    "general": 1,
    "misto": 1,
    "rayon": 1,
    "selo": 0.5
}

OBLAST_BASE = {"confidence": 0, "places": set()}

MONTH_DICT = {
        "січня": 1, "лютого": 2, "березня": 3,
        "квітня": 4, "травня": 5, "червня": 6,
        "липня": 7, "серпня": 8, "вересня": 9,
        "жовтня": 10, "листопада": 11, "грудня": 12
    }

DEFAULT_HEADERS = {"User-Agent": ""}
