export const OBLAST_TO_NUM = {
    '1': 'Автономна Республіка Крим',
    '2': 'Вінницька область',
    '3': 'Волинська область',
    '4': 'Дніпропетровська область',
    '5': 'Донецька область',
    '6': 'Житомирська область',
    '7': 'Закарпатська область',
    '8': 'Запорізька область',
    '9': 'Івано-Франківська область',
    '10': 'Київська область',
    '11': 'Кіровоградська область',
    '12': 'Луганська область',
    '13': 'Львівська область',
    '14': 'Миколаївська область',
    '15': 'Одеська область',
    '16': 'Полтавська область',
    '17': 'Рівненська область',
    '18': 'Сумська область',
    '19': 'Тернопільська область',
    '20': 'Харківська область',
    '21': 'Херсонська область',
    '22': 'Хмельницька область',
    '23': 'Черкаська область',
    '24': 'Чернівецька область',
    '25': 'Чернігівська область'
}

export const DEFAULT_LIMIT = 3;

export const MIN_DATE = "2022-02-24";
export const MAX_DATE = "2023-02-24";
export const DEFAULT_START_TIMESTAMP = 1645660800;
export const DEFAULT_END_TIMESTAMP = 1677196800;

export const sampleArticle = {
    "_id": "626828608192fce6457c4bc0",
    "article_id": "686282",
    "title": "Уряд виділив додаткові 400 мільйонів на відновлення критичної інфраструктури",
    "news_provider_name": "Pravda",
    "article_type": "economyPravda",
    "link": "https://www.epravda.com.ua/news/2022/04/26/686282/",
    "time_published": "2022-04-26 19:11:00",
    "published_timestamp": 1650989460,
    "time_collected": "2022-04-26 20:14:06.108438",
    "text_language": "UA",
    "tags": [
        "Кабмін",
        "гроші",
        "війна",
        "інфраструктура"
    ],
    "confidence": 1,
    "places": [
        "Харківська"
    ]
}